/* Имя оператора по умолчанию, если не подгрузилась информация */
"agent_name_default" = "Operator";

/* Надпись к сообщениям клиента */
"agent_name_you" = "Siz";

"Agent.DisplayName.Deleted" = "Oʻchirilgan operator";

/* Normally user iOS device doesn't return "Restricted" camera access status. But for test purposes we've added an alert with this string message anyway. */
"Camera.Access.Restricted" = "Kameradan foydalanish cheklangan";

"Camera.Access.Suggestion" = "Suratga olish uchun kameraga ruxsat kerak.\n\nKirishga ruxsat berish uchun [Qurilma sozlamalari > Ilovangiz > Kamera] bo‘limiga o‘ting.";

/* Alert with this message displays when you try to take a photo from camera on iOS simulator or when real device experiencing some technical issues. */
"Camera.Access.Unavailable" = "Kamera mavjud emas";

"chat_input.status.contact_info" = "Iltimos, kontaktlaringizni ko'rsating";

/* Подзаголовок окна чата по умолчанию */
"chat_subtitle_placeholder" = "24/7 aloqada!";

/* Системное сообщение в ленте чата, говорящее о том, что произошел разрыв соединения  с сервером. */
"chat_system_disconnected" = "Tarmoq xatosi: %d,  xato matni: %s";

/* Системное сообщение в ленте чата, говорящее о том, что в данный момент несколько агентов набирают сообщение. */
"chat_system_few_agents_typing" = "%s, %s va %d xabar yozmoqda...";

/* Системное сообщение в ленте чата, говорящее о том, что в данный момент один агент набирает сообщение. */
"chat_system_one_agent_typing" = "%s xabar yozmoqda...";

/* Системное сообщение в ленте чата, говорящее о том, что в данный момент два агента набирают сообщение. */
"chat_system_two_agents_typing" = "%s va %s xabar yozmoqda...";

/* Заголовок окна чата по умолчанию */
"chat_title_placeholder" = "Qo'llab-quvvatlash chati";

"chat.state_unavailable.discription" = "Chat hozirda ish holatida emas. Birozdan keyin yozishga harakat qilishingizni so'raymiz.";

"chat.state_unavailable.title" = "Chat vaqtincha ish holatida emas";

"chat.system.contact_form.introduce_in_chat" = "Chatda o'zingizni tanishtiring";

"chat.system.contact_form.must_fill" = "Sizga javob bera olishimiz uchun kontakt ma'lumotlaringizni kiriting";

"chat.system.contact_form.status_sent" = "Endi sizning xabarlaringiz yo'qolmaydi. Operatorlarning javobi chatga va ko'rsatilgan kontaktlarga keladi.";

"Chat.System.Media.Preparing" = "Fayl tayyorlanmoqda...";

"Chat.System.Media.Uploading" = "Fayl yuborilmoqda...";

"Chat.System.NewMessages" = "Yangi xabarlar";

"Client.Title" = "Mijoz №%d";

/* Общая строка "Отмена" */
"common_cancel" = "Bekor qilish";

"common_close" = "Yopish";

"common_done" = "Tayyor";

/* Универсальное сообщение о неизвестной ошибке. */
"common_unknown_error" = "Texnik xatolik";

"Common.Open" = "Ochish";

"common.send" = "Yuborish";

/* Состояние подключения к сервису */
"connection_state_connecting" = "Ulanilmoqda…";

/* Состояние отсутствия подключения */
"connection_state_disconnected" = "Ulanib bo‘lmadi, %d soniyadan keyin qayta uriniladi.";

/* Кнопка для повторного подключения к сервису, не дожидаясь таймаута  */
"connection_state_retry" = "Hoziroq ulanish";

"contact_form.email.placeholder" = "Sizning e-mail manzilingiz";

"contact_form.name.placeholder" = "Sizning ismingiz";

"contact_form.phone.placeholder" = "Sizning telefon raqamingiz";

"contact_form.status.sent" = "Rahmat!";

/* Статус загрузки - ошибка */
"download_status_error" = "Xato";

/* Статус загрузки - загрузка */
"download_status_loading" = "Yuklanmoqda...";

/* Ошибка загрузки файла, если ссылка устарела. */
"file_download_expired" = "Havola muddati oʻtgan";

/* Message letting user know that file is unavailable for download. */
"file_download_unavailable" = "Fayl mavjud emas";

/* Проверка ссылки на файл */
"file_link_checking" = "Tekshirilmoqda...";

/* Default file name */
"file_name_unknown" = "Nomsiz fayl";

"file_transfer_disabled" = "Fayl yuborish o‘chirilgan";

/* Формат для размера файла в байтах */
"format_file_size_b" = "%.0f B";

/* Формат для размера файла в килобайтах */
"format_file_size_kb" = "%.0f KB";

/* Формат для размера файла в мегабайтах */
"format_file_size_mb" = "%.2f MB";

/* Подсказка в окне ввода сообщения */
"input_message_placeholder" = "Xabaringizni kiriting...";

"jivo_business_messenger" = "Biznes-messenjer";

/* Надпись на кнопке контекстного меню выбора типа вложения. Нажатие на кнопку открывает системный пикер документов. */
"media_upload_attachment_type_selecting_document" = "Hujjat";

/* Надпись на кнопке контекстного меню выбора типа вложения. Нажатие на кнопку вызывает пикер фотогалереи. */
"media_upload_attachment_type_selecting_photo" = "Foto";

/* Заголовок с вопросом о том, какой тип вложения пользователь хочет прикрепить к сообщению. */
"media_upload_select_an_attachment_type_title" = "Nima yuborishni xohlaysiz?";

/* Системное сообщение в ленте чата, говорящее о том, что в данный момент ведётся загрузка файла на сервер. */
"media_upload_sending_the_file" = "Fayl yuborilmoqda";

"media_uploading_common_error" = "Faylni yuklashda xato";

/* Ошибка, возникающая при неудачной подготовке файла к загрузке. */
"media_uploading_extraction_error" = "Faylni tayyorlash amalga oshmadi";

/* Превышение лимита выгружаемого файла */
"media_uploading_too_large" = "Fayl hajmi %dMB dan oshmasligi kerak";

"Media.Access.Missing" = "Kirishga ruxsat bering";

"Media.Access.Suggestion" = "Foto va videolarni jo‘natish uchun galereyaga kirish talab qilinadi.\n\nKirishga ruxsat berish uchun [Qurilma sozlamalari > Ilovangiz > Foto] bo‘limiga o‘ting.";

"Media.Picker.Camera" = "Kamera";

/* Пункт меню "Копировать ссылку" */
"menu_action_copy" = "Havolani ko'chirib olish";

/* Пункт меню "Cкачать" */
"menu_action_download" = "Yuklab olish";

/* Кнопка скачать для прикрепленного документа/файла */
"message_download" = "Yuklab olish";

/* Системное сообщение о присоединении оператора к чату */
"message_system_operator_accepted" = "Operator suhbatga qo'shildi";

/* Unsupported file type */
"message_unsupported_media" = "Ushbu fayl turi qo'llab-quvvatlanmaydi";

"Message.Deleted" = "Xabar oʻchirib tashlangan";

"Message.Edited" = "(o'zgartirilgan)";

"Message.Preview.Line" = "Muloqot ikkinchi liniyaga o'tkazildi";

"Message.Sender.Bot" = "bot";

"Message.Sender.You" = "Siz";

"messages.label.bot" = "bot";

"notification_channel_message_description" = "Jivo SDK dan xabar";

"notification_channel_message_name" = "Jivo";

/* Format for text message where $1 is agent name, $2 - text message */
"notification_message_text_format" = "%1$s: %2$s";

"notification_message_title" = "Qo'llab-quvvatlash";

"offline_message_placeholder" = "Hozirda operatorlar aloqada emas. Iltimos, xabaringizni qoldiring va biz siz bilan albatta bog'lanamiz.";

/* Пункт "Копировать" контекстного меню, вызываемого долгим тапом по бабблу сообщения. */
"options_copy" = "Ko'chirish";

/* Пункт "Повторить отправку" контекстного меню, вызываемого долгим тапом по бабблу сообщения. */
"options_resend" = "Qayta jo'natish";

/* Normally an alert with this message shouldn't be displayed but for test purposes it was added to SDK anyway.
, If there is an error then the alert should be displayed on photo library access try when starting to pick images. */
"PhotoLibrary.Access.NoAvailableImages" = "Suratlar mavjud emas";

/* Normally an alert with this message shouldn't be displayed but for test purposes it was added to SDK anyway */
"PhotoLibrary.Access.Unavailable" = "Fotokutubxonaga kirish cheklangan";

"toast_copied_to_clipboard" = "Ko‘chirildi";

/* Unsupported message type bubble discription */
"unsupported_message_description" = "Ilova versiyasi eskirgan. Xabar tafsilotlari: %s";

/* postfix */
"unsupported_message_postfix" = "batafsil \u0020";

/* Title for unsupported message bubble  */
"unsupported_message_title" = "Qo'llab-quvvatlanmaydigan xabar turi";

/* Приветственное сообщение для пустого чата */
"welcome_message_placeholder" = "Mobil ilovada biror narsa ishlamadi yoki tushunarsizmi? Yozing, biz yordam beramiz!";

